<?php

/**
 * Задание 1
 *
 * Напишите код, возвращающий строку, содержащую все цифры от 2 до $n (включительно)
 * Пример: для $n = 5, результат будет "2345"
 */
function task1($n) {
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}


/**
 * Задание 2
 *
 * Напишите код, возвращающий строку, содержащую все цифры от $n до 25 (включительно)
 */
function task2($n) {
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}

/**
 * Задание 3
 *
 * Дан массив с индексами 0 и 1. Элементы массива - числа.
 * Напишите код, возвращающий строку с числами от нулевого числа до первого,
 * разделенных пробелами. Известно, что первое число больше нулевого.
 * Пример для $arr = [2,4], результат будет "2 3 4"
 */
function task3($arr) {
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}

/**
 * Задание 4
 *
 * В функцию передается ассоциативный массив, где ключ - название Города,
 * значение - кол-во людей населяющих его. Верните новый массив, где
 * значения - строки вида "[Город], население: [число] человек"
 */
function task4($arr) {
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся массив
    return $result;
}

/**
 * Задание 5
 *
 * В функцию передается массив, удалите каждый четный элемент
 */
function task5($arr) {
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}
