<?php

/**
 * Задание 1
 * Напишите код преобразующий метры в километры
 * Запишите результат в переменную $result
 */
function task1($m) {
    $meters = $m; // в переменной $meters будут лежать метры, используйте её
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}


/**
 * Задание 2
 *
 * Напишите код преобразующий километры в метры
 * Запишите результат в переменную $result
 */
function task2($km) {
    $kilometers = $km; // в переменной $kilometers будут лежать километры, используйте её
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}

/**
 * Задание 3
 *
 * Напишите код преобразующий градусы Целисия в Фаренгейты
 * Запишите результат в переменную $result
 */
function task3($c) {
    $celsius = $c; // в переменной $celsius лежат градусы Цельсия, используйте её
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}

/**
 * Задание 4
 *
 * Напишите код преобразующий градусы Кельвина в Целисия
 * Запишите результат в переменную $result
 */
function task4($k) {
    $kelvin = $k; // в переменной $kelvin лежат градусы Кельвина, используйте её
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}

/**
 * Задание 5
 *
 * Напишите код преобразующий string в integer
 * Запишите результат в переменную $result
 */
function task5($s) {
    $string = $s; // в переменной $string лежит строка, используйте её
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}

/**
 * Задание 6
 *
 * Напишите код преобразующий integer в string
 * Запишите результат в переменную $result
 */
function task6($i) {
    $integer = $i; // в переменной $integer лежит целое число, используйте её
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}

/**
 * Задание 7
 *
 * Получите текущее время (часы и минуты) в формате HH:MM (например 15:34)
 * Запишите результат в переменную $result
 */
function task7() {
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}
