<?php

/**
 * Задание 1
 *
 * Напишите код вычисляющий полное имя на основе короткого: (Петя => Петр).
 * Возможные варианты на вход: Макс, Света, Вова, Катя
 */
function task1($n) {
    $name = $n; // в переменной $name будут лежать короткое имя
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}


/**
 * Задание 2
 *
 * Напишите код, который в зависимости от кол-ва, создает
 * фразу {{ кол-во человек }}, c правильным окончанием
 * Например, если кол-во: 3, то результат будет: "3 человека"
 * Максимальное кол-во: 23
 */
function task2($q) {
    $quantity = $q; // в переменной $quantity будет лежать кол-во
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}

/**
 * Задание 3
 *
 * Напишите код, который вычисляет кол-во элементов в массиве
 */
function task3($a) {
    $array = $a; // в переменной $array будет лежать массив
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}

/**
 * Задание 4
 *
 * Напишите код, вычисляющий строковое представление чисел от 0 до 9
 * Например для числа 5, результат: "пять"
 */
function task4($n) {
    $number = $n; // в переменной $number будет лежать число
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся результат
    return $result;
}

/**
 * Задание 5
 *
 * Напишите код, добавляющий в конец индексированного массива число 177
 */
function task5($a) {
    $array = $a; // в переменной $array будет лежать массив
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся массив
    return $result;
}

/**
 * Задание 6
 *
 * Напишите код, удаляющий первый элемент массива
 */
function task6($a) {
    $array = $a; // в переменной $array будет лежать массив
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся массив
    return $result;
}

/**
 * Задание 7
 *
 * Напишите код, удаляющий последний элемент массива
 */
function task7($a) {
    $array = $a; // в переменной $array будет лежать массив
    // ваш код
    $result = null; // сюда, вместо null, запишите получившийся массив
    return $result;
}
